04_Simulation/1.FROZEN/SST_MediumBody_with.inlet.dat.profile.interpolated_GEP_Tr.aijx.squCyl.region_Ha5_newfrozenaijxRij_hat.3.eve/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// NOTE OF6 setting
type sets;
//type surfaces;
libs ("libsampling.so");

setFormat raw;
//surlineFaceFormat vtk;
surlineFaceFormat raw;
//surfaceFormat   raw;
//surfaceFormat   vtk;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPoint;

fields
(
U Rall
//R
);


sets
(

//    frozen {
//        type points;
//        //type cloud;
//        axis xyz;
//        ordered true;
//        points (
//            #include "Points.H"
//        );
//
//        interpolate true;
//    }

    // BOW
    XoRp-0.1
    {
        type        lineFace; //lineUniform; //lineFace;
        axis        y;

        start       (-0.1  0.0 0); //
        end         (-0.1  1. 0); // 
        //nPoints     100;
    }
 
    XoRp0.0
    {
        type        lineFace;
        axis        y;

        start       (0.  0.0 0); //
        end         (0.  1. 0); // 
    }
    XoRp0.1
    {
        type        lineFace;
        axis        y;

        start       (0.1  0.0 0); //
        end         (0.1  1. 0); // 
    }
    XoRp0.2
    {
        type        lineFace;
        axis        y;

        start       (0.2  0.0 0); //
        end         (0.2  1. 0); // 
    }
    XoRp0.3
    {
        type        lineFace;
        axis        y;

        start       (0.3  0.0 0); //
        end         (0.3  1. 0); // 
    }
    XoRp0.4
    {
        type        lineFace;
        axis        y;

        start       (0.4  0.0 0); //
        end         (0.4  1. 0); // 
    }
    XoRp0.5
    {
        type        lineFace;
        axis        y;

        start       (0.5  0.0 0); //
        end         (0.5  1. 0); // 
    }
    XoRp0.6
    {
        type        lineFace;
        axis        y;

        start       (0.6  0.0 0); //
        end         (0.6  1. 0); // 
    }
    XoRp0.7
    {
        type        lineFace;
        axis        y;

        start       (0.7  0.0 0); //
        end         (0.7  1. 0); // 
    }
    XoRp0.8
    {
        type        lineFace;
        axis        y;

        start       (0.8  0.0 0); //
        end         (0.8  1. 0); // 
    }
    XoRp0.9
    {
        type        lineFace;
        axis        y;

        start       (0.9  0.0 0); //
        end         (0.9  1. 0); // 
    }
    XoRp1.0
    {
        type        lineFace;
        axis        y;

        start       (1.0  0.0 0); //
        end         (1.0  1. 0); // 
    }
    XoRp1.1
    {
        type        lineFace;
        axis        y;

        start       (1.1  0.0 0); //
        end         (1.1  1. 0); // 
    }
    // CENTER
    XoRp4.17
    {
        type        lineFace;
        axis        y;

        start       (4.17 0.0 0.0); //
        end         (4.17 1.0 0.0); // 
    }
    XoRp4.37
    {
        type        lineFace;
        axis        y;

        start       (4.37 0.0 0.0); //
        end         (4.37 1.0 0.0); // 
    }
    XoRp4.57
    {
        type        lineFace;
        axis        y;

        start       (4.57 0.0 0.0); //
        end         (4.57 1.0 0.0); // 
    }
    XoRp4.77
    {
        type        lineFace;
        axis        y;

        start       (4.77 0.0 0.0); //
        end         (4.77 1.0 0.0); // 
    }
    XoRp4.97
    {
        type        lineFace;
        axis        y;

        start       (4.97 0.0 0.0); //
        end         (4.97 1.0 0.0); // 
    }
    XoRp5.17
    {
        type        lineFace;
        axis        y;

        start       (5.17 0.0 0.0); //
        end         (5.17 1.0 0.0); // 
    }
    XoRp5.37
    {
        type        lineFace;
        axis        y;

        start       (5.37 0.0 0.0); //
        end         (5.37 1.0 0.0); // 
    }
    // STERN
    XoRp8.67
    {
        type        lineFace;
        axis        y;

        start       (8.67 0.0 0.0); //
        end         (8.67 1.0 0.0); // 
    }
    XoRp8.92
    {
        type        lineFace;
        axis        y;

        start       (8.92 0.0 0.0); //
        end         (8.92 1.0 0.0); // 
    }
    XoRp9.17
    {
        type        lineFace;
        axis        y;

        start       (9.17 0.0 0.0); //
        end         (9.17 1.0 0.0); // 
    }
    XoRp9.42
    {
        type        lineFace;
        axis        y;

        start       (9.42 0.0 0.0); //
        end         (9.42 1.0 0.0); // 
    }
    XoRp9.67
    {
        type        lineFace;
        axis        y;

        start       (9.67 0.0 0.0); //
        end         (9.67 1.0 0.0); // 
    }
    XoRp9.92
    {
        type        lineFace;
        axis        y;

        start       (9.92 0.0 0.0); //
        end         (9.92 1.0 0.0); // 
    }
    XoRp10.17
    {
        type        lineFace;
        axis        y;

        start       (10.17 0.0 0.0); //
        end         (10.17 1.0 0.0); // 
    }
    XoRp10.42
    {
        type        lineFace;
        axis        y;

        start       (10.42 0.0 0.0); //
        end         (10.42 1.0 0.0); // 
    }   
    XoRp10.67
    {
        type        lineFace;
        axis        y;

        start       (10.67 0.0 0.0); //
        end         (10.67 1.0 0.0); // 
    }
    XoRp10.92
    {
        type        lineFace;
        axis        y;

        start       (10.92 0.0 0.0); //
        end         (10.92 1.0 0.0); // 
    }
    XoRp11.17
    {
        type        lineFace;
        axis        y;

        start       (11.17 0.0 0.0); //
        end         (11.17 1.0 0.0); // 
    }
    XoRp11.42
    {
        type        lineFace;
        axis        y;

        start       (11.42 0.0 0.0); //
        end         (11.42 1.0 0.0); // 
    }
    XoRp11.67
    {
        type        lineFace;
        axis        y;

        start       (11.67 0.0 0.0); //
        end         (11.67 1.0 0.0); // 
    }
    XoRp11.92
    {
        type        lineFace;
        axis        y;

        start       (11.92 0.0 0.0); //
        end         (11.92 1.0 0.0); // 
    }
    XoRp12.17
    {
        type        lineFace;
        axis        y;

        start       (12.17 0.0 0.0); //
        end         (12.17 1.0 0.0); // 
    }
    // WAKE
    XoRp12.9167
    {
        type        lineFace;
        axis        y;

        start       (12.9167 0.0 0.0); //
        end         (12.9167 1.0 0.0); // 
    }
    XoRp13.4167
    {
        type        lineFace;
        axis        y;

        start       (13.4167 0.0 0.0); //
        end         (13.4167 1.0 0.0); // 
    }
    XoRp13.9167
    {
        type        lineFace;
        axis        y;

        start       (13.9167 0.0 0.0); //
        end         (13.9167 1.0 0.0); // 
    }
    XoRp14.4167
    {
        type        lineFace;
        axis        y;

        start       (14.4167 0.0 0.0); //
        end         (14.4167 1.0 0.0); // 
    }
    XoRp14.9167
    {
        type        lineFace;
        axis        y;

        start       (14.9167 0.0 0.0); //
        end         (14.9167 1.0 0.0); // 
    }
    XoRp15.4167
    {
        type        lineFace;
        axis        y;

        start       (15.4167 0.0 0.0); //
        end         (15.4167 1.0 0.0); // 
    }
    XoRp15.9167
    {
        type        lineFace;
        axis        y;

        start       (15.9167 0.0 0.0); //
        end         (15.9167 1.0 0.0); // 
    }
    XoRp16.4167
    {
        type        lineFace;
        axis        y;

        start       (16.4167 0.0 0.0); //
        end         (16.4167 1.0 0.0); // 
    }
);

//surfaces (
//    BoR
//    {
//        type            patch;
//        patches         (BoR);
//        interpolate true;
//        triangulate false;
//    }
    
//    Z_0_Plane
//        {
//            type                cuttingPlane;
//            planeType           pointAndNormal;
//            pointAndNormalDict
//            {
//                basePoint       (0 0 0);  
//                normalVector    (0 0 1);
//            }
//            interpolate         true;
//        }
    
//    X_0_Plane
//        {
//            type                cuttingPlane;
//            planeType           pointAndNormal;
//            pointAndNormalDict
//            {
//                basePoint       (0 0 0);  
//                normalVector    (1 0 0);
//            }
//            interpolate         true;
//        }
//    
//    Y_0_Plane
//        {
//            type                cuttingPlane;
//            planeType           pointAndNormal;
//            pointAndNormalDict
//            {
//                basePoint       (0 0 0); 
//                normalVector    (0 1 0);
//            }
//            interpolate         true;
//        }

//Z_0p25h_Plane
//        {
//            type                cuttingPlane;
//            planeType           pointAndNormal;
//            pointAndNormalDict
//            {
//                basePoint       (0 0 0.25);  // Notet that the plane does not match up with the mesh
//                normalVector    (0 0 1);
//            }
//            interpolate         true;
//        }
//);

// *********************************************************************** //
